//: C11:FreeStandingReferences.cpp
#include <iostream>
using namespace std;

// Пользовательская ссылочная переменная:
int y;
int& r = y;
// При создании ссылка должна инициализироваться
// существующим объектом. 
// Следовательно, возможна запись вида:
const int& q = 12;  // (1)
// Ссылка связывается с памятью, занимаемой другой переменной:
int x = 0;          // (2)
int& a = x;         // (3)
int main() {
  cout << "x = " << x << ", a = " << a << endl;
  a++;
  cout << "x = " << x << ", a = " << a << endl;
} ///:~